Hello Terraform team,

Here is the debug & plan output 

### Debug Output
https://gist.github.com/artichaulo/5530c2380f4a2c6138d090f50a003bc8

### plan output
```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

aws_ebs_volume.volume-a: Refreshing state... [id=vol-0ee2c76f1719d817e]
data.template_cloudinit_config.cloudinit: Refreshing state...
aws_instance.foo: Refreshing state... [id=i-09287e6395d4a70c7]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_cloudinit_config.cloudinit will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "cloudinit"  {
      + base64_encode = false
      + gzip          = false
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = "#cloud-config\npreserve_hostname: false\nhostname: bar \nrepo_update: true\nrepo_upgrade: all\n\npackages:\n  - lvm2\n  - htop\n  - vim\n  - ntp\n  - curl\n  - zip\n  - python-dev\n  - python-pip\n  - rsync\n  - nfs-common\n  - unzip\n  - ca-certificates\n  - wget\n  - jq\n\n# Configure bashrc, vim and other stuff\nruncmd:\n  - echo \"alias ll='ls -ltrh'\" >> /home/ubuntu/.bashrc\n  - echo \"alias ll='ls -ltrh'\" >> /root/.bashrc\n  - echo \"syntax on\" >> /home/ubuntu/.vimrc\n  - echo \"syntax on\" >> /root/.vimrc\n  \noutput:\n  all: '| tee -a /var/log/cloud-init-output.log'\n\n"
          + content_type = "text/cloud-config"
          + filename     = "cloud-config"
        }
      + part {
          + content      = "#!/bin/bash\n\necho \"my id is vol-0ee2c76f1719d817e\"\n"
          + content_type = "text/x-shellscript"
        }
    }

  # aws_ebs_volume.volume-a will be updated in-place
  ~ resource "aws_ebs_volume" "volume-a" {
        arn               = "arn:aws:ec2:eu-west-1:644297085323:volume/vol-0ee2c76f1719d817e"
        availability_zone = "eu-west-1a"
        encrypted         = true
        id                = "vol-0ee2c76f1719d817e"
        iops              = 100
        kms_key_id        = "arn:aws:kms:eu-west-1:644297085323:key/7e6461ff-837b-4e8c-b95b-fe1d8c2ddf9d"
        size              = 10
      ~ tags              = {
          ~ "FOO" = "change-me" -> "change-mee"
        }
        type              = "gp2"
    }

  # aws_instance.foo must be replaced
-/+ resource "aws_instance" "foo" {
        ami                          = "ami-0e58c687b1228df2f"
      ~ arn                          = "arn:aws:ec2:eu-west-1:644297085323:instance/i-09287e6395d4a70c7" -> (known after apply)
      ~ associate_public_ip_address  = false -> (known after apply)
      ~ availability_zone            = "eu-west-1b" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 1 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
        get_password_data            = false
      + host_id                      = (known after apply)
      ~ id                           = "i-09287e6395d4a70c7" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
        instance_type                = "t2.micro"
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + network_interface_id         = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-0fa8114f7606056e3" -> (known after apply)
      ~ private_dns                  = "ip-10-196-133-104.eu-west-1.compute.internal" -> (known after apply)
      ~ private_ip                   = "10.196.133.104" -> (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ security_groups              = [] -> (known after apply)
        source_dest_check            = true
        subnet_id                    = "subnet-9e9e79f8"
      - tags                         = {} -> null
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data                    = "f108a43b6021c7b27c255decbed14cbabf40b43a" -> (known after apply) # forces replacement
      ~ volume_tags                  = {} -> (known after apply)
      ~ vpc_security_group_ids       = [
          - "sg-3ab74340",
        ] -> (known after apply)

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ encrypted             = true -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          ~ kms_key_id            = "arn:aws:kms:eu-west-1:433357556783:key/d79927bd-b636-4651-8816-fad31e42e3bb" -> (known after apply)
          ~ volume_id             = "vol-075729a1545ed550c" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```

